//-------------------------------------------------------------------------------
// header file
// 	- 프로그램에서 필요한 
//	- 미리 정의된 소스코드들
//	- 기타 외부 링크
//-------------------------------------------------------------------------------
// header파일에 포함되는것
//-------------------------------------------------------------------------------
// 1) #include 구문들

#include <stdio.h>
#include <stdlib.h> // exit()

// 2) 함수의 선언이 온다
#include "app.h"
#include "fnc.h"


// 3) #define -> 전처리기 지시어!

// 4) 구조체선언 

// 5) 전역변수!!







