//------------------------------------------------------
// - 배열
// --> 정의: 연속된 메모리공간 같은 타입의 변수들의 집합!
//	1) 연속된 메모리공간에 존재한다!
//	2) 같은 파일
//------------------------------------------------------
// 변수들 
//------------------------------------------------------
//	배열은 자료구조!
//		자료구조:
//		-- 데이타를 저장하고 보관하고 관리하는 논리적인 구조!
//------------------------------------------------------
// 어떻게 보관할거야? 어떻게 저장할거야? 를 고민하는것이 자료구조
//------------------------------------------------------
// 배열: 같은타입의 자료를 여러개 모아서 보관
// 
// 배열의 선언과 자료구조

#include <stdio.h>
//#define SIZE 10; // 10은 앞으로 SIZE로 명명
void main(){

//	int array = 0; // 변수 [0]
//	int arrays[5]; //[0][0][0][0][0] 5개가 만들어짐
	//printf("arrays: %d \n", sizeof(arrays));
	// int가 4byte니깐 5개 -> 20byte가 나옴

//  타입 배열이름[크기];
//	int Arrays[5]; // int형 변수 5개의 공간을 할당하고 Array라 하겠다!
//	int exa[SIZE];
	// ex) 사용자에게 5개의 정수를 입력받아라
	// 50개를 받으면?
	// 배열의 크기는 항상 상수값! -> 변하지 않는 값!
	
	// 상수만들기
	// #define -> 전처리 기 키워드
	// const
//	const int MAX = 5; 
//	int ex1[MAX];

//	printf("%d", ++MAX);

	// 배열의 크기는 항상 같은 고정된 크기를 갖는다





}