//-------------------------------------
// 반복문
// - 코드의 일정 부분을 반복해서 실행하는 구문 !!
//---------------------------------------------------
// ex) 화면에 bit를 5번 출력하라 !!
// - while
// - for
// - do ~ while
// ------------------------------
// - while
// c언어 최초의 반복문 !!
// - 불편한점이 존재한다 -->개선 --> for, do ~while
//-----------------------------------------------------------
// 반복문의 3요소!!
// 주어진 문제에서 3가지 요소를 찾는 연습 필요
// 1) 초기값 : 시작값 ~~ 에서 부터
// 2) 조 건  : 종료값 ---> ~~까지
// 3) 증 감  : 간  격 ---> 얼마 만큼
//------------------------------------------------------------
// ex) 1~5 화면에 출력해라 !
// 초기값 : 1
// 조건   : 5
// 증감   : ++
//--------------------------------------------------------
// ex) 화면에 A ~~ Z를 출력해라 !!
// --------------------------------------------------------
// 초기값 : A       65
// 조건   : Z       90
// 증감   : ++      ++
// ex) 1~100까지 수중에 짝수를 모두 출력
// 초기값 : 2
// 조건   : 100
// 증감   : +2
//-----------------------------------------------------------------
// ex) 나는 오늘부터 4월 30일까지 매일 4시간씩 코딩을 하겠다
// ----------------------------------------------------------------
// 초기값 : 4월9일
// 조건   : 4월30일
// 증감   : ++

#include <stdio.h>
void main()
{
	/*int i =1 ; // 1)초기값
	while(i<=5)   // 2)조건
	{
		printf("%d\n",i); // 실행
		i++ ; // 3)증감
	}
}
	int i=0 ;

	for(i = 1;i<=5;i++)
		printf("%d\n", i);
	puts("");

	i=1;
	while(i<=5)
	{
		printf("%d", i);
		i++ ;
	}
	int i = 1;
	do
	{
		//실행코드
		printf("%d", i++);
	}while(i<=5); // 조건검사 !!

// 실행의 결과를 통해 다음 실행을 결정하는 경우 !!
// 최초 실행으로 다음 실행의 결과가 만들어 지는 경우 !!
// ex) 사용자가 0을 입력할때까지 계속해서 정수를 입력 받는 코드 !!
	int val=0;
	do
	{
		printf("input: ");
		scanf("%d", &val);
	}while(val != 0);// 조건검사!!
*/
 int ch='*' ;
 
	
	 printf("%d\n", ch);





}

